tests/result_artilleryCluster.txt
Phase started: unnamed (index: 0, duration: 1s) 02:13:30(-0500)

Phase completed: unnamed (index: 0, duration: 1s) 02:13:31(-0500)

--------------------------------------
Metrics for period to: 02:13:40(-0500) (width: 6.901s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 294/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 1036
  median: ...................................................................... 111.1
  p95: ......................................................................... 262.5
  p99: ......................................................................... 497.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4654.5
  max: ......................................................................... 6753.5
  median: ...................................................................... 5487.5
  p95: ......................................................................... 6439.7
  p99: ......................................................................... 6702.6


All VUs finished. Total time: 8 seconds

--------------------------------
Summary report @ 02:13:37(-0500)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 147/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 1036
  median: ...................................................................... 111.1
  p95: ......................................................................... 262.5
  p99: ......................................................................... 497.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4654.5
  max: ......................................................................... 6753.5
  median: ...................................................................... 5487.5
  p95: ......................................................................... 6439.7
  p99: ......................................................................... 6702.6