tests/result_artilleryFork.txt
Phase started: unnamed (index: 0, duration: 1s) 02:12:29(-0500)

Phase completed: unnamed (index: 0, duration: 1s) 02:12:30(-0500)

--------------------------------------
Metrics for period to: 02:12:30(-0500) (width: 0.76s)
--------------------------------------

http.codes.200: ................................................................ 24
http.codes.302: ................................................................ 47
http.request_rate: ............................................................. 115/sec
http.requests: ................................................................. 115
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 294
  median: ...................................................................... 47
  p95: ......................................................................... 267.8
  p99: ......................................................................... 290.1
http.responses: ................................................................ 71
vusers.created: ................................................................ 39
vusers.created_by_name.0: ...................................................... 39


--------------------------------------
Metrics for period to: 02:12:40(-0500) (width: 9.989s)
--------------------------------------

http.codes.200: ................................................................ 611
http.codes.302: ................................................................ 617
http.request_rate: ............................................................. 126/sec
http.requests: ................................................................. 1253
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 457
  median: ...................................................................... 257.3
  p95: ......................................................................... 383.8
  p99: ......................................................................... 424.2
http.responses: ................................................................ 1228
vusers.created: ................................................................ 11
vusers.created_by_name.0: ...................................................... 11


--------------------------------------
Metrics for period to: 02:12:50(-0500) (width: 5.691s)
--------------------------------------

http.codes.200: ................................................................ 365
http.codes.302: ................................................................ 336
http.request_rate: ............................................................. 118/sec
http.requests: ................................................................. 632
http.response_time:
  min: ......................................................................... 138
  max: ......................................................................... 417
  median: ...................................................................... 267.8
  p95: ......................................................................... 368.8
  p99: ......................................................................... 407.5
http.responses: ................................................................ 701
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 14903.5
  max: ......................................................................... 15610.8
  median: ...................................................................... 15526
  p95: ......................................................................... 15526
  p99: ......................................................................... 15526


All VUs finished. Total time: 18 seconds

--------------------------------
Summary report @ 02:12:46(-0500)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 457
  median: ...................................................................... 257.3
  p95: ......................................................................... 383.8
  p99: ......................................................................... 424.2
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 14903.5
  max: ......................................................................... 15610.8
  median: ...................................................................... 15526
  p95: ......................................................................... 15526
  p99: ......................................................................... 15526